Revit 2027 API
Document.Export(String, String, GBXMLExportOptions) Method
 Export the model in gbXML (green-building) format.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool Export(
	string folder,
	string name,
	GBXMLExportOptions options
)
Public Function Export (
	folder As String,
	name As String,
	options As GBXMLExportOptions
) As Boolean
public:
bool Export(
	String^ folder,
	String^ name,
	GBXMLExportOptions^ options
)
member Export :
        folder : string *
        name : string *
        options : GBXMLExportOptions -> bool
Parameters
folder String
 Indicates the path of a folder where to export the gbXML file.
name String
 Indicates the name of the gbXML file to export. If it doesn't end with ".xml", extension ".xml" will be added automatically. The name cannot contain any of the following characters: \/:*?"<>|. Empty name is not acceptable.
options GBXMLExportOptions
 Options which control the contents of the export.
Return Value
Boolean
 True if successful, otherwise False.
Exceptions
Exception | Condition
ArgumentException |  The path is not valid for exporting gbXML files. -or- The name is empty or not valid for exporting gbXML files.
ArgumentNullException |  A non-optional argument was null
InvalidOperationException |  This Document is not a project document. -or- This Document is in an edit mode. -or- Exporting is not allowed in the current application mode. -or- Export is temporarily disabled. -or- There is no EnergyAnalysisDetailModel in the document.
ModificationForbiddenException |  The document is in failure mode: an operation has failed, and Revit requires the user to either cancel the operation or fix the problem (usually by deleting certain elements). -or- The document is being loaded, or is in the midst of another sensitive process.
ModificationOutsideTransactionException |  The document has no open transaction.
Remarks
 This export operation will operate on the main EnergyAnalysisDetailModel in the document, if it exists (see EnergyAnalysisDetailModel.GetMainEnergyAnalysisDetailModel()). If it does not exist, or if the requested ExportEnergyModelType does not match the type of the main EnergyAnalysisDetailModel, this function will fail. If you need to export a model with different settings or type than the current main energy model in the document, you should delete the current main energy model, update the EnergyAnalysisSettings, and regenerate the energy model. This method should be called from a transaction.
See Also
Reference
Document Class
Export Overload
Autodesk.Revit.DB Namespace